<!doctype linuxdoc system>

<ARTICLE>

<TITLE>Anleitung f&uuml;r den ``Morsemann'' v1.1
<AUTHOR>Dirk B&auml;chle (<TT>dl9obn@darc.de</TT>)
<DATE>2003-03-07

<ABSTRACT>
Ein kleines Programm zum Lernen und &Uuml;ben des H&ouml;rens
von Morsezeichen (CW). Es kennt die Zeichen &dquot;a-z&dquot;, 
&dquot;0-9&dquot; und &dquot;.,=?/&dquot;.
</ABSTRACT>

<TOC>

<SECT>Start des Programmes<LABEL ID="start">

<P>
Der <EM>Morsemann</EM> l&auml;sst sich unter DOS und
Windows problemlos starten. Unter Linux muss
folgendes beachtet werden: Da das Programm direkt auf
die Hardware, bzw. im Fall des Speakers auf die Konsole,
zugreift, ben&ouml;tigt man Root-Rechte um etwas zu h&ouml;ren.
Also bitte vor dem Aufruf des <EM>Morsemann</EM>s in den Root-Modus
wechseln mit:

<TSCREEN><VERB>
su
</VERB></TSCREEN>

Falls man nicht immer wieder <TT>su</TT> und das Passwort eingeben
m&ouml;chte, kann man f&uuml;r die Datei `<TT>morsemann</TT>' auch
das entsprechende Ausf&uuml;hrungs-Bit setzen. Dazu wechselt man wie beschrieben
in den Superuser-Modus und ruft:

<TSCREEN><VERB>
make allusers
</VERB></TSCREEN>

auf. Anschlie&szlig;end kann man den <EM>Morsemann</EM> als normaler Benutzer/User
starten (er wird aber im Root-Modus ausgef&uuml;hrt)...

<P>
Hinweise f&uuml;r das Kompilieren unter den verschiedenen Betriebssystemen
findet man in der Datei `<TT>README</TT>'.

<SECT>Hauptfenster<LABEL ID="main">

<P>
Nach dem Start des Programmes wird das Hauptfenster angezeigt.
Die Auswahl von Men&uuml;punkten erfolgt im gesamten
Programm mit den Pfeil-Tasten
(<TT>CursorUp</TT> und <TT>CursorDown</TT>), best&auml;tigt wird
mit der <TT>RETURN</TT>-Taste. Falls man nicht gerade eine 
<REF ID="text" NAME="Texteingabe">
macht, kommt man mit der <TT>BACKSPACE</TT>-Taste zur&uuml;ck zum
vorherigen Fenster.

<P>W&auml;hlt man den Punkt ``Start'', so beginnt der <EM>Morsemann</EM>
mit der Ausgabe von Morsezeichen entsprechend den eingestellten Optionen.
Wie man diese &auml;ndert wird im Abschnitt
<REF ID="options" NAME="Optionen">
beschrieben.

<P> Mit der <TT>BACKSPACE</TT>-Taste kann die Ausgabe der Zeichen
unterbrochen werden. Ansonsten h&auml;lt das Programm nicht eher
an, bis die gew&uuml;nschte Anzahl von Zeichen erreicht ist.
Durch Bet&auml;tigen einer
beliebigen Taste gelangt man dann wieder in das Hauptfenster.

<P>
Bei Auswahl des Punktes ``Beenden'' wird das Programm ... naja,
beendet.

<SECT>Optionen<LABEL ID="options">

<P>
Folgende Optionen sind verf&uuml;gbar:

<ITEMIZE>
<ITEM> <BF>Zeichen</BF>: Ein weiteres Fenster erscheint und man kann
die gew&uuml;nschte Gruppe von Zeichen w&auml;hlen. Mit dem Punkt
``Zeichen eingeben'' kann man seinen eigenen Zeichenvorrat (maximal
75 Zeichen!) zusammenstellen, aus diesem w&auml;hlt der 
<EM>Morsemann</EM> dann zuf&auml;llig aus.
Die mehrfache Eingabe erh&ouml;ht die H&auml;ufigkeit mit der das Zeichen
im Ausgabetext erscheint. Es sind nur die unterst&uuml;tzten Zeichen
zugelassen und es d&uuml;rfen keine Leerzeichen eingegeben werden!
<ITEM> <BF>Geschwindigkeit</BF>: In einem eigenen Fenster kann man mit
den Pfeil-Tasten die Geschwindigkeit im Bereich 10-250 BPM (Buchstaben
pro Minute) einstellen.
<ITEM> <BF>Pausenfaktor</BF>: Der Pausenfaktor verl&auml;ngert die
Abst&auml;nde zwischen den einzelnen Morsezeichen und auch zwischen
kompletten W&ouml;rtern. Ist er z.B. auf ``2'' gestellt, so sind
die Pausen doppelt so lang wie normal. Er kann im Bereich 1-9 gew&auml;hlt
werden. Hinweis: Der Faktor ``4'' bei einem Tempo von 45 BPM entspricht
den Einstellungen f&uuml;r Pr&uuml;fungen nach der Farnsworth-Methode. 
<ITEM> <BF>Zeichenanzahl</BF>: Die Zeichenanzahl ist von 5-9999 per
<REF ID="text" NAME="Texteingabe">
einstellbar.
<ITEM> <BF>Feste Wortgruppen</BF>: Steht diese Option auf ``Ja'', so erzeugt
der <EM>Morsemann</EM> alle W&ouml;rter mit der gleichen L&auml;nge.
Diese steht hinter der Option in Klammern und kann durch Bet&auml;tigen
der Links- und Rechts-Pfeil-Tasten (CursorLeft und CursorRight) im Bereich
2-8 ver&auml;ndert werden. Ist ``Nein'' angew&auml;hlt, so variiert
die Wortl&auml;nge zuf&auml;llig von 3 bis 8.
<ITEM> <BF>Zeichen best&auml;tigen</BF>: Die Standardeinstellung ist
hier ``Nein''. Der <EM>Morsemann</EM> gibt dann Zeichen um Zeichen, ohne
auf eine R&uuml;ckmeldung vom Benutzer zu warten. Ist ``Buchstaben''
gew&auml;hlt, muss jedes einzelne Zeichen best&auml;tigt werden.
Dazu tippen Sie auf der Tastatur einfach das Zeichen, das Sie meinen
geh&ouml;rt zu haben. War die Eingabe richtig, so erklingt sofort das
n&auml;chste Zeichen. Bei einem Fehler erklingt ein Fehler-Ton
und das richtige Zeichen erscheint
in roter Schrift auf dem Bildschirm. Am Ende der Ausgabe wird die
Gesamtanzahl der Fehler noch einmal angezeigt. &Auml;hnlich 
verh&auml;lt sich der <EM>Morsemann</EM> auch bei der Einstellung
``Worte''. Jetzt m&uuml;ssen allerdings ganze Worte geh&ouml;rt und
dann durch
<REF ID="text" NAME="Texteingabe">
best&auml;tigt werden. 
</ITEMIZE>

<SECT>Texteingaben<LABEL ID="text">

<P>
Bei Texteingaben verliert die <TT>BACKSPACE</TT>-Taste f&uuml;r
kurze Zeit ihre Bedeutung als ``Zum-vorherigen-Fenster-zur&uuml;ck''.
Sie dient dann dazu einzelne Buchstaben zu l&ouml;schen. Texteingaben
im <EM>Morsemann</EM> k&ouml;nnen auf zwei Arten abgeschlossen werden:
Durch die <TT>RETURN</TT>- oder die <TT>ESC</TT>-Taste. Mit der
<TT>RETURN</TT>-Taste akzeptiert man die gemachten &Auml;nderungen, bei
<TT>ESC</TT> werden sie verworfen.

</ARTICLE>

